In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data = {
    'timestamp': ['2023-01-01 12:00', '2023-01-02 13:00', '2023-01-03 14:00'],
    'value': [100, 200, 300]
}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

          timestamp  value
0  2023-01-01 12:00    100
1  2023-01-02 13:00    200
2  2023-01-03 14:00    300

In [6]:
df['timestamp'] = pd.to_datetime(df['timestamp'])

In [7]:
df

            timestamp  value
0 2023-01-01 12:00:00    100
1 2023-01-02 13:00:00    200
2 2023-01-03 14:00:00    300

In [8]:
df.set_index('timestamp',inplace=True)

In [9]:
df

                     value
timestamp
2023-01-01 12:00:00    100
2023-01-02 13:00:00    200
2023-01-03 14:00:00    300

In [10]:
data = {
    'date': pd.to_datetime(['2023-10-01', '2023-10-02', '2023-10-03']),
    'value': [10, np.nan, 30]
}

In [11]:
df = pd.DataFrame(data)

In [12]:
df

        date  value
0 2023-10-01   10.0
1 2023-10-02    NaN
2 2023-10-03   30.0

In [13]:
df['value'].fillna(df['value'].mean(), inplace=True)

C:\Users\HC\AppData\Local\Temp\ipykernel_11312\2576884877.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['value'].fillna(df['value'].mean(), inplace=True)

In [14]:
df

        date  value
0 2023-10-01   10.0
1 2023-10-02   20.0
2 2023-10-03   30.0

In [15]:
data = {
    'date': pd.to_datetime(['2023-10-01', '2023-10-02', '2023-10-03', '2023-10-04']),
    'value': [10, np.nan, np.nan, 40]
}
df = pd.DataFrame(data)
df

        date  value
0 2023-10-01   10.0
1 2023-10-02    NaN
2 2023-10-03    NaN
3 2023-10-04   40.0

In [16]:
df['value'].fillna(method='ffill', inplace=True)

C:\Users\HC\AppData\Local\Temp\ipykernel_11312\2797584597.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['value'].fillna(method='ffill', inplace=True)
C:\Users\HC\AppData\Local\Temp\ipykernel_11312\2797584597.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['value'].fillna(method='ffill', inplace=True)

In [17]:
df

        date  value
0 2023-10-01   10.0
1 2023-10-02   10.0
2 2023-10-03   10.0
3 2023-10-04   40.0

In [18]:
data = {
    'date': pd.to_datetime(['2023-10-01', '2023-10-02', '2023-10-03', '2023-10-04']),
    'value': [10, np.nan, np.nan, 40]
}
df = pd.DataFrame(data)

In [19]:
df

        date  value
0 2023-10-01   10.0
1 2023-10-02    NaN
2 2023-10-03    NaN
3 2023-10-04   40.0

In [20]:
df['value'].fillna(method='bfill',inplace=True)

C:\Users\HC\AppData\Local\Temp\ipykernel_11312\68241726.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['value'].fillna(method='bfill',inplace=True)
C:\Users\HC\AppData\Local\Temp\ipykernel_11312\68241726.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['value'].fillna(method='bfill',inplace=True)

In [21]:
df

        date  value
0 2023-10-01   10.0
1 2023-10-02   40.0
2 2023-10-03   40.0
3 2023-10-04   40.0

In [22]:
data = {
    'A': [1, np.nan, 3],
    'B': [np.nan, 5, 6],
    'C': [7, 8, np.nan]
}
df = pd.DataFrame(data)

In [23]:
df

     A    B    C
0  1.0  NaN  7.0
1  NaN  5.0  8.0
2  3.0  6.0  NaN

In [24]:
df.fillna(0, axis=0, inplace=True)

In [25]:
df

     A    B    C
0  1.0  0.0  7.0
1  0.0  5.0  8.0
2  3.0  6.0  0.0

In [26]:
data = {
    'date': pd.to_datetime(['2023-10-01', '2023-10-02', '2023-10-03', '2023-10-04']),
    'value': [10, np.nan, np.nan, 40]
}
df = pd.DataFrame(data)

In [27]:
df

        date  value
0 2023-10-01   10.0
1 2023-10-02    NaN
2 2023-10-03    NaN
3 2023-10-04   40.0

In [28]:
df['value'].fillna(2, limit=2, inplace=True)

C:\Users\HC\AppData\Local\Temp\ipykernel_11312\1012810781.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['value'].fillna(2, limit=2, inplace=True)

In [29]:
df

        date  value
0 2023-10-01   10.0
1 2023-10-02    2.0
2 2023-10-03    2.0
3 2023-10-04   40.0

In [30]:
data = {
    'date': pd.to_datetime(['2023-10-01', '2023-10-02', '2023-10-03', '2023-10-04']),
    'value': [10, np.nan, np.nan, 40]
}
df = pd.DataFrame(data)

In [31]:
df

        date  value
0 2023-10-01   10.0
1 2023-10-02    NaN
2 2023-10-03    NaN
3 2023-10-04   40.0

In [32]:
df['value'].interpolate(inplace=True)

C:\Users\HC\AppData\Local\Temp\ipykernel_11312\143821238.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['value'].interpolate(inplace=True)

In [33]:
df

        date  value
0 2023-10-01   10.0
1 2023-10-02   20.0
2 2023-10-03   30.0
3 2023-10-04   40.0

In [34]:
data = {
    'date': pd.to_datetime(['2023-10-01', '2023-10-02', '2023-10-03', '2023-10-04']),
    'value': [10, np.nan, np.nan, 40]
}
df = pd.DataFrame(data)

In [35]:
df

        date  value
0 2023-10-01   10.0
1 2023-10-02    NaN
2 2023-10-03    NaN
3 2023-10-04   40.0

In [49]:
df['value'].interpolate(method='time')

date
2023-10-01    10.0
2023-10-02    20.0
2023-10-03    30.0
2023-10-04    40.0
Name: value, dtype: float64

In [53]:
data = {
    'date': pd.to_datetime(['2023-10-01', '2023-10-02', '2023-10-03', '2023-10-04']),
    'value': [10, np.nan, np.nan, 40]
}
df = pd.DataFrame(data)

In [55]:
df

        date  value
0 2023-10-01   10.0
1 2023-10-02    NaN
2 2023-10-03    NaN
3 2023-10-04   40.0

In [57]:
df.dropna(inplace=True)

In [59]:
df

        date  value
0 2023-10-01   10.0
3 2023-10-04   40.0

In [61]:
data = {
    'A': [1, np.nan, 3],
    'B': [np.nan, 5, 6],
    'C': [7, 8, np.nan]
}
df = pd.DataFrame(data)

In [73]:
df

     A    B    C
0  1.0  NaN  7.0
1  NaN  5.0  8.0
2  3.0  6.0  NaN

In [77]:
df.dropna(how='any')

Empty DataFrame
Columns: [A, B, C]
Index: []

In [87]:
data = {
    'A': [1, np.nan, 3],
    'B': [np.nan, 5, 6],
    'C': [7, 8, 3]
}
df = pd.DataFrame(data)

In [89]:
df

     A    B  C
0  1.0  NaN  7
1  NaN  5.0  8
2  3.0  6.0  3

In [91]:
df.dropna(thresh=3)

     A    B  C
2  3.0  6.0  3